{
  "intro": "Over a decade of experience in working with different technologies.</br> I focus on running scalable infrastructure in Google Cloud using modern cloud-native architecture patterns.</br> I enjoy addressing difficult technical challanges.",
  "careerInfo": [
     {
      "time": "Jan, 2021",
      "company": "Gumtree",
      "Type": "Job",
      "Description": "",
      "title": "Site Reliability Engineer"
    },
    {
      "time": "Nov, 2018",
      "company": "Transforming Systems",
      "Type": "Job",
      "Description": "As a DevOps Lead, I work and build my own Kubernetes Clusters. Love manipulating and working with HAProxy. Kubernetes, Terraform, Ansible, HAProxy, Python, Go, Shell are my favorites",
      "title": "Site Reliability Engineer"
    },
    {
      "time": "Feb, 2018",
      "company": "Transforming Systems",
      "Type": "Job",
      "Description": "As a polyglot developer, I help the organisation to co-design and develop many real-time systems and services to NHS partners. Currently, the development provides intelligence systems based on real-time data for 26 CCGs across England, covering multiple providers including primary care, acute hospitals, 111, ambulance services, secondary care, etc. Technologies involved in the project development are Spring Boot, Angular, Mongo, MySQL, NodeJS, Mobile application development, Devops etc.",
      "title": "Senior Developer"
    },
    {
      "time": "Jun, 2014",
      "company": "Startup",
      "Type": "Job",
      "Description": "Worked on several ideas involving iOS application development, Android application development, Restful API, NodeJS, NoSQL, MySQL, Artificial Intelligence, Web Spider using Python and AWS.",
      "title": "Co-Founder/Programmer"
    },
    {
      "time": "Mar, 2012",
      "company": "Tata Consultancy Services",
      "Type": "Job",
      "Description": "Worked as a Mainframe programmer for American Express, handling several projects in relation to different geographic locations.",
      "title": "Systems Engineer"
    },
    {
      "time": "Jun, 2011",
      "company": "CVR College of Engineering",
      "Type": "Student",
      "Description": "Graduated with a Bachelors degree in the field of Electronics and Communication Engineering from Jawaharlal Nehru Institute of Technology Hyderabad",
      "title": "Graduated (Bachelors)"
    }
  ],
  "projectInfo": [
    {
      "url": "https://github.com/hayorov/helm-gcs",
      "title": "helm-gcs"
    },
    {
      "url": "https://github.com/TejaBeta/kubectl-istiolog",
      "title": "kubectl-istiolog"
    }
  ],

  "techStack": {
    "languages": [
      "GoLang",
      "Bash"
    ],
    "technologies": [
      "Kubernetes",
      "Istio",
      "Spinnaker",
      "Terraform",
      "Ansible",
      "Puppet",
      "GCP",
      "AWS",
      "OpenStack",
      "HAProxy",
      "Postgres"
    ]
  }
}
